app/views/orders/_form.html.erb

SELECT "pay_types".* FROM "pay_types"
---
    <%= f.label :pay_type %><br />
    <%= f.select :pay_type, Order::PAYMENT_TYPES, :prompt => 'Select a payment method' %>