app/views/carts/show.html.erb

<h2>Your Pragmatic Cart</h2> <ul>
<% @cart.line_items.each do |item| %> <li><%= item.product.title %></li>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 19
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1