app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "3"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 03 Apr 2013 21:38:31 UTC +00:00], ["updated_at", Wed, 03 Apr 2013 21:38:31 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 20], ["created_at", Mon, 22 Apr 2013 12:41:04 UTC +00:00], ["product_id", 3], ["quantity", 1], ["updated_at", Mon, 22 Apr 2013 12:41:04 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-04-22 12:42:30.389566' WHERE "line_items"."id" = 12
---
  def create
   # @line_item = LineItem.new(params[:line_item])
    @cart = current_cart #references the current cart which was defined in application controller
    product = Product.find(params[:product_id]) #finds the product by the ID within the URL
    @line_item = @cart.add_product(product.id, product.price) #uses add_product method in cart.rb to check if the line item already exists in the cart and responds accordingly
    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "29"]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-04-25 09:27:49.171424' WHERE "line_items"."id" = 74
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 24 Apr 2013 20:23:16 UTC +00:00], ["updated_at", Wed, 24 Apr 2013 20:23:16 UTC +00:00]]
---
  def destroy
    @cart = current_cart
    line_item = LineItem.find(params[:id])
    @line_item = @cart.decrement_line_item_quantity(line_item.id)

    respond_to do |format|
      if @line_item.save