app/controllers/line_items_controller.rb

  def create
   # @line_item = LineItem.new(params[:line_item])
    @cart = current_cart #references the current cart which was defined in application controller
    product = Product.find(params[:product_id]) #finds the product by the ID within the URL
    sku = Sku.find(params[:line_item][:sku_id])
    # FIXME: This is becoming rather long. Refactor and move away from controller if possible.
    @line_item = @cart.add_product(product.id, sku.price, sku.id, sku.length, sku.thickness, sku.weight, sku.sku, sku.attribute_value, sku.attribute_type.name, sku.attribute_type.measurement, params[:line_item][:quantity]) #uses add_product method in cart.rb to check if the line item already exists in the cart and responds accordingly
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 20 AND "line_items"."product_id" = 3 LIMIT 1