app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate(:page => params[:page], :order => 'created_at desc', :per_page => 10)

SELECT "pay_types".* FROM "pay_types"
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 38
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 38
---
  def new
    @pay_type = PayType.all #adds pay_type database to the select form tag
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 39]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 38
---
  def create
    @cart = current_cart
    @order = Order.new(params[:order]) # want all the data from the form so select the :order hash
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver # pass the current @order into the method within Notifier class, then execute the delivery

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "new"]]
---
  def destroy
    @order = Order.find(params[:id])