app/controllers/products_controller.rb

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
UPDATE "products" SET "title" = 'Lorem Ipsum', "description" = 'About Lorem Ipsum and how it landed in the internet', "image_url" = 'lorem.jpg', "price" = 20, "updated_at" = '2013-04-03 08:26:36.774894' WHERE "products"."id" = 980190962